Log from local workstation
```
=== RUN   TestTerraformCreateGCPSQL
TestTerraformCreateGCPSQL 2022-03-21T15:14:08+07:00 test_structure.go:130: Copied terraform folder ../example to /var/folders/tg/hg1rc57d34nd17njqn__zry40000gn/T/TestTerraformCreateGCPSQL3484022788/terraform-gcp-sql/example
TestTerraformCreateGCPSQL 2022-03-21T15:14:08+07:00 retry.go:91: terraform [init -upgrade=false]
TestTerraformCreateGCPSQL 2022-03-21T15:14:08+07:00 logger.go:66: Running command terraform with args [init -upgrade=false]
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: Initializing modules...
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: - test_sql_database_1 in ../modules/google_sql_database
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: - test_sql_database_2 in ../modules/google_sql_database
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: - test_sql_database_instance in ../modules/google_sql_database_instance
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: - test_sql_user in ../modules/google_sql_user
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: Initializing the backend...
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: Initializing provider plugins...
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: - Finding latest version of hashicorp/random...
TestTerraformCreateGCPSQL 2022-03-21T15:14:09+07:00 logger.go:66: - Finding hashicorp/google versions matching "4.14.0"...
TestTerraformCreateGCPSQL 2022-03-21T15:14:10+07:00 logger.go:66: - Installing hashicorp/random v3.1.2...
TestTerraformCreateGCPSQL 2022-03-21T15:14:10+07:00 logger.go:66: - Installed hashicorp/random v3.1.2 (signed by HashiCorp)
TestTerraformCreateGCPSQL 2022-03-21T15:14:11+07:00 logger.go:66: - Installing hashicorp/google v4.14.0...
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: - Installed hashicorp/google v4.14.0 (signed by HashiCorp)
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: Terraform has created a lock file .terraform.lock.hcl to record the provider
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: selections it made above. Include this file in your version control repository
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: so that Terraform can guarantee to make the same selections by default when
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: you run "terraform init" in the future.
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: Terraform has been successfully initialized!
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: You may now begin working with Terraform. Try running "terraform plan" to see
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: any changes that are required for your infrastructure. All Terraform commands
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: should now work.
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: If you ever set or change modules or backend configuration for Terraform,
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: rerun this command to reinitialize your working directory. If you forget, other
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: commands will detect it and remind you to do so if necessary.
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 retry.go:91: terraform [apply -input=false -auto-approve -lock=false]
TestTerraformCreateGCPSQL 2022-03-21T15:14:12+07:00 logger.go:66: Running command terraform with args [apply -input=false -auto-approve -lock=false]
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + create
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: Terraform will perform the following actions:
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   # random_id.instance_suffix will be created
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + resource "random_id" "instance_suffix" {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + b64_std     = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + b64_url     = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + byte_length = 4
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + dec         = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + hex         = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + id          = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   # random_id.random_string will be created
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + resource "random_id" "random_string" {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + b64_std     = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + b64_url     = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + byte_length = 12
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + dec         = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + hex         = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + id          = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   # module.test_sql_database_1.google_sql_database.database will be created
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + collation = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + id        = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + instance  = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + name      = "db-first"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + project   = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + self_link = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   # module.test_sql_database_2.google_sql_database.database will be created
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + collation = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + id        = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + instance  = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + name      = "db-second"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + project   = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + self_link = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   # module.test_sql_database_instance.google_sql_database_instance.instance will be created
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + resource "google_sql_database_instance" "instance" {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + connection_name               = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + database_version              = "MYSQL_8_0"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + deletion_protection           = false
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + first_ip_address              = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + id                            = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + ip_address                    = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + master_instance_name          = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + name                          = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + private_ip_address            = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + project                       = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + public_ip_address             = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + region                        = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + self_link                     = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + server_ca_cert                = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + service_account_email_address = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + replica_configuration {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + ca_certificate            = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + client_certificate        = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + client_key                = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + connect_retry_interval    = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + dump_file_path            = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + failover_target           = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + master_heartbeat_period   = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + password                  = (sensitive value)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + ssl_cipher                = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + username                  = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + verify_server_certificate = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + settings {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + activation_policy     = "ALWAYS"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + availability_type     = "ZONAL"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + disk_autoresize       = true
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + disk_autoresize_limit = 20
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + disk_size             = 10
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + disk_type             = "PD_SSD"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + pricing_plan          = "PER_USE"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + tier                  = "db-f1-micro"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + user_labels           = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + version               = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + backup_configuration {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + binary_log_enabled             = true
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + enabled                        = true
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + start_time                     = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + transaction_log_retention_days = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + backup_retention_settings {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:                   + retained_backups = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:                   + retention_unit   = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:                 }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + ip_configuration {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + ipv4_enabled = true
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + require_ssl  = true
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:           + location_preference {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + follow_gae_application = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:               + zone                   = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   # module.test_sql_user.google_sql_user.users will be created
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + resource "google_sql_user" "users" {
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + host     = "localhost"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + id       = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + instance = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + name     = "sql-user"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + password = (sensitive value)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:       + project  = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: Plan: 6 to add, 0 to change, 0 to destroy.
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: Changes to Outputs:
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + random_string                                    = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_sql_database_1_id                           = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_sql_database_1_self_link                    = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_sql_database_2_id                           = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_sql_database_2_self_link                    = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_sql_user_name                               = "sql-user"
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_sql_user_password                           = (sensitive value)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_terraform_sql_connection_name               = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_terraform_sql_first_ip_address              = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_terraform_sql_instance_name                 = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_terraform_sql_self_link                     = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66:   + test_terraform_sql_service_account_email_address = (known after apply)
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: random_id.random_string: Creating...
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: random_id.instance_suffix: Creating...
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: random_id.random_string: Creation complete after 0s [id=fJw8UO7QqVRjs9cT]
TestTerraformCreateGCPSQL 2022-03-21T15:14:15+07:00 logger.go:66: random_id.instance_suffix: Creation complete after 0s [id=3bt1Zg]
TestTerraformCreateGCPSQL 2022-03-21T15:14:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Creating...
TestTerraformCreateGCPSQL 2022-03-21T15:14:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:14:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:14:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:14:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:15:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:15:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:15:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:15:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:15:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:15:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:16:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [1m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:16:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:16:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:16:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:16:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:16:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:17:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [2m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:17:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:17:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:17:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:17:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:17:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:18:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [3m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:18:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:18:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:18:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:18:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:18:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:19:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [4m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:19:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:19:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:19:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:19:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:19:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:20:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [5m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:20:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:20:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:20:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:20:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:20:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:21:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [6m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:21:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:21:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:21:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:21:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:21:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:22:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [7m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:22:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:22:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:22:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:22:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:22:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:23:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [8m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:23:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:23:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:23:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:23:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:23:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:24:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [9m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:24:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:24:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:24:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:24:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:24:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:25:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [10m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:25:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:25:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:25:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:25:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:25:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:26:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [11m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:26:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:26:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:26:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:26:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:26:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:27:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [12m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:27:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:27:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:27:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:27:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:27:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:28:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [13m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:28:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [14m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:28:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [14m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:28:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [14m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:28:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [14m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:28:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [14m40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:29:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still creating... [14m50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:29:11+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Creation complete after 14m55s [id=sql-instance-ddbb7566]
TestTerraformCreateGCPSQL 2022-03-21T15:29:11+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Creating...
TestTerraformCreateGCPSQL 2022-03-21T15:29:11+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Creating...
TestTerraformCreateGCPSQL 2022-03-21T15:29:11+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Creating...
TestTerraformCreateGCPSQL 2022-03-21T15:29:17+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Creation complete after 6s [id=projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second]
TestTerraformCreateGCPSQL 2022-03-21T15:29:21+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:29:21+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Still creating... [10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:29:21+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Creation complete after 10s [id=projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first]
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Creation complete after 14s [id=sql-user/localhost/sql-instance-ddbb7566]
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: Apply complete! Resources: 6 added, 0 changed, 0 destroyed.
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: Outputs:
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: random_string = "7c9c3c50eed0a95463b3d713"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_sql_database_1_id = "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_sql_database_1_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_sql_database_2_id = "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_sql_database_2_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_sql_user_name = "sql-user"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_sql_user_password = <sensitive>
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_terraform_sql_connection_name = "test-terraform-project-01:asia-southeast2:sql-instance-ddbb7566"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_terraform_sql_first_ip_address = "34.101.129.52"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_terraform_sql_instance_name = "sql-instance-ddbb7566"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_terraform_sql_self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: test_terraform_sql_service_account_email_address = "p434072338061-q8en4b@gcp-sa-cloud-sql.iam.gserviceaccount.com"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 retry.go:91: terraform [output -no-color -json random_string]
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: Running command terraform with args [output -no-color -json random_string]
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: "7c9c3c50eed0a95463b3d713"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_instance_name]
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_instance_name]
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: "sql-instance-ddbb7566"
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_self_link]
TestTerraformCreateGCPSQL 2022-03-21T15:29:25+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_self_link]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566"
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_service_account_email_address]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_service_account_email_address]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: "p434072338061-q8en4b@gcp-sa-cloud-sql.iam.gserviceaccount.com"
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 retry.go:91: terraform [output -no-color -json test_terraform_sql_connection_name]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_terraform_sql_connection_name]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: "test-terraform-project-01:asia-southeast2:sql-instance-ddbb7566"
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 retry.go:91: terraform [output -no-color -json test_sql_user_name]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_user_name]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: "sql-user"
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_1_id]
TestTerraformCreateGCPSQL 2022-03-21T15:29:26+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_1_id]
TestTerraformCreateGCPSQL 2022-03-21T15:29:27+07:00 logger.go:66: "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first"
TestTerraformCreateGCPSQL 2022-03-21T15:29:27+07:00 retry.go:91: terraform [output -no-color -json test_sql_database_2_id]
TestTerraformCreateGCPSQL 2022-03-21T15:29:27+07:00 logger.go:66: Running command terraform with args [output -no-color -json test_sql_database_2_id]
TestTerraformCreateGCPSQL 2022-03-21T15:29:27+07:00 logger.go:66: "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second"
TestTerraformCreateGCPSQL 2022-03-21T15:29:27+07:00 retry.go:91: terraform [destroy -auto-approve -input=false -lock=false]
TestTerraformCreateGCPSQL 2022-03-21T15:29:27+07:00 logger.go:66: Running command terraform with args [destroy -auto-approve -input=false -lock=false]
TestTerraformCreateGCPSQL 2022-03-21T15:29:28+07:00 logger.go:66: random_id.random_string: Refreshing state... [id=fJw8UO7QqVRjs9cT]
TestTerraformCreateGCPSQL 2022-03-21T15:29:28+07:00 logger.go:66: random_id.instance_suffix: Refreshing state... [id=3bt1Zg]
TestTerraformCreateGCPSQL 2022-03-21T15:29:29+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Refreshing state... [id=sql-instance-ddbb7566]
TestTerraformCreateGCPSQL 2022-03-21T15:29:29+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Refreshing state... [id=projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first]
TestTerraformCreateGCPSQL 2022-03-21T15:29:29+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Refreshing state... [id=projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second]
TestTerraformCreateGCPSQL 2022-03-21T15:29:29+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Refreshing state... [id=sql-user/localhost/sql-instance-ddbb7566]
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: Terraform used the selected providers to generate the following execution
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: plan. Resource actions are indicated with the following symbols:
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - destroy
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: Terraform will perform the following actions:
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   # random_id.instance_suffix will be destroyed
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - resource "random_id" "instance_suffix" {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - b64_std     = "3bt1Zg==" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - b64_url     = "3bt1Zg" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - byte_length = 4 -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - dec         = "3720050022" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - hex         = "ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - id          = "3bt1Zg" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   # random_id.random_string will be destroyed
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - resource "random_id" "random_string" {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - b64_std     = "fJw8UO7QqVRjs9cT" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - b64_url     = "fJw8UO7QqVRjs9cT" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - byte_length = 12 -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - dec         = "38565018480643609104701708051" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - hex         = "7c9c3c50eed0a95463b3d713" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - id          = "fJw8UO7QqVRjs9cT" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   # module.test_sql_database_1.google_sql_database.database will be destroyed
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - charset   = "utf8mb4" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - collation = "utf8mb4_0900_ai_ci" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - id        = "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - instance  = "sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - name      = "db-first" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - project   = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   # module.test_sql_database_2.google_sql_database.database will be destroyed
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - resource "google_sql_database" "database" {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - charset   = "utf8mb4" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - collation = "utf8mb4_0900_ai_ci" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - id        = "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - instance  = "sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - name      = "db-second" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - project   = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - self_link = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   # module.test_sql_database_instance.google_sql_database_instance.instance will be destroyed
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - resource "google_sql_database_instance" "instance" {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - connection_name               = "test-terraform-project-01:asia-southeast2:sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - database_version              = "MYSQL_8_0" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - deletion_protection           = false -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - first_ip_address              = "34.101.129.52" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - id                            = "sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - ip_address                    = [
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - ip_address     = "34.101.129.52"
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - time_to_retire = ""
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - type           = "PRIMARY"
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:             },
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:         ] -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - name                          = "sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - project                       = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - public_ip_address             = "34.101.129.52" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - region                        = "asia-southeast2" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - server_ca_cert                = [
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - cert             = <<-EOT
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     -----BEGIN CERTIFICATE-----
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     MIIDfzCCAmegAwIBAgIBADANBgkqhkiG9w0BAQsFADB3MS0wKwYDVQQuEyQzNDIx
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     ODU1My0yNzVmLTQyMzgtYTgyZS0yNjE5YzE1YWQ4YTExIzAhBgNVBAMTGkdvb2ds
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     ZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUsIEluYzELMAkG
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     A1UEBhMCVVMwHhcNMjIwMzIxMDgxNDQ1WhcNMzIwMzE4MDgxNTQ1WjB3MS0wKwYD
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     VQQuEyQzNDIxODU1My0yNzVmLTQyMzgtYTgyZS0yNjE5YzE1YWQ4YTExIzAhBgNV
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     BAMTGkdvb2dsZSBDbG91ZCBTUUwgU2VydmVyIENBMRQwEgYDVQQKEwtHb29nbGUs
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     IEluYzELMAkGA1UEBhMCVVMwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     AQCPgcnL7NuMLzoF6fmQjOfbuvGbC9/CU/6/+ftUHznVH5IhbgfWJXJliiPE0T3D
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     L/Og8XjROSI+YgVbxMehW6xRj6XZwams9wzFvq5p9s6uXlVbuXRCBU9ux5LMcefD
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     SJvg2qGegzuuNA21TqrtR6gkTkL7MVD3t8AZ6YCtSh0TYFvOfVmh+FJa5au0MssT
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     wpR5uEZNsgFeNG4PDMQuPyPJFbX+rut0TnVDbJSgr2SOwYVv0j+DjU11ujG2OlOr
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     ZPOhkvBCnyrArw9dGp1NykF1PX69gO3B1rU2+cOTCeFdkIcjGqdFWeY0kf1PZdXT
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     iS7qtH5QNXBx0rj4TvPlxU35AgMBAAGjFjAUMBIGA1UdEwEB/wQIMAYBAf8CAQAw
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     DQYJKoZIhvcNAQELBQADggEBAGAcMvRwoU5XFiz0yd37NwWDvXeKCvsNPeT9Wibm
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     LkYmKWt6EJtJ/gjJHLOTwLkk7CzRN0duLhKDMEr3B/zbIEw7ELjei7SC1lQ4YauC
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     ywvMu9kO9DwYOI2CkpHyrcu8r34+3nvD5fUXxM+1F7Beq+V9tKdmKW2RJcwYkjUs
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     LvEsrKTf0DfTY3Zr2vEPH5lTIRCVjnZwB6vSIsau74avnFUigLF64otxFgPa3fRd
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     qT5RtLAo7ZG6Mj+vBiGFzdoZPBb4ljGi9tZm2mR+yQLzl0hwZvq1ODhJeJswsHeS
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     uBdV2xM8w+02r/cTLowk94hEihFy9K3xi6jXBTkpVShObu8=
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                     -----END CERTIFICATE-----
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                 EOT
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - common_name      = "C=US,O=Google\\, Inc,CN=Google Cloud SQL Server CA,dnQualifier=34218553-275f-4238-a82e-2619c15ad8a1"
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - create_time      = "2022-03-21T08:14:45.378Z"
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - expiration_time  = "2032-03-18T08:15:45.378Z"
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - sha1_fingerprint = "a8c893bfd331f608890a006ad2f550e14ee31272"
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:             },
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:         ] -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - service_account_email_address = "p434072338061-q8en4b@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - settings {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - activation_policy     = "ALWAYS" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - availability_type     = "ZONAL" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - disk_autoresize       = true -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - disk_autoresize_limit = 20 -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - disk_size             = 10 -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - disk_type             = "PD_SSD" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - pricing_plan          = "PER_USE" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - tier                  = "db-f1-micro" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - user_labels           = {} -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - version               = 1 -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - backup_configuration {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - binary_log_enabled             = true -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - enabled                        = true -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - point_in_time_recovery_enabled = false -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - start_time                     = "02:00" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - transaction_log_retention_days = 7 -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - backup_retention_settings {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                   - retained_backups = 7 -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                   - retention_unit   = "COUNT" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:                 }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - ip_configuration {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - ipv4_enabled = true -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - require_ssl  = true -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:           - location_preference {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:               - zone = "asia-southeast2-b" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:             }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:         }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   # module.test_sql_user.google_sql_user.users will be destroyed
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - resource "google_sql_user" "users" {
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - host     = "localhost" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - id       = "sql-user/localhost/sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - instance = "sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - name     = "sql-user" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - password = (sensitive value)
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:       - project  = "test-terraform-project-01" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:     }
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: Plan: 0 to add, 0 to change, 6 to destroy.
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66: Changes to Outputs:
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - random_string                                    = "7c9c3c50eed0a95463b3d713" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_sql_database_1_id                           = "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_sql_database_1_self_link                    = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_sql_database_2_id                           = "projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_sql_database_2_self_link                    = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_sql_user_name                               = "sql-user" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_sql_user_password                           = (sensitive value)
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_terraform_sql_connection_name               = "test-terraform-project-01:asia-southeast2:sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_terraform_sql_first_ip_address              = "34.101.129.52" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_terraform_sql_instance_name                 = "sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_terraform_sql_self_link                     = "https://sqladmin.googleapis.com/sql/v1beta4/projects/test-terraform-project-01/instances/sql-instance-ddbb7566" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:32+07:00 logger.go:66:   - test_terraform_sql_service_account_email_address = "p434072338061-q8en4b@gcp-sa-cloud-sql.iam.gserviceaccount.com" -> null
TestTerraformCreateGCPSQL 2022-03-21T15:29:33+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Destroying... [id=projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-second]
TestTerraformCreateGCPSQL 2022-03-21T15:29:33+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Destroying... [id=sql-user/localhost/sql-instance-ddbb7566]
TestTerraformCreateGCPSQL 2022-03-21T15:29:33+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Destroying... [id=projects/test-terraform-project-01/instances/sql-instance-ddbb7566/databases/db-first]
TestTerraformCreateGCPSQL 2022-03-21T15:29:35+07:00 logger.go:66: module.test_sql_database_1.google_sql_database.database: Destruction complete after 3s
TestTerraformCreateGCPSQL 2022-03-21T15:29:38+07:00 logger.go:66: module.test_sql_database_2.google_sql_database.database: Destruction complete after 5s
TestTerraformCreateGCPSQL 2022-03-21T15:29:43+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Still destroying... [id=sql-user/localhost/sql-instance-ddbb7566, 10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:29:46+07:00 logger.go:66: module.test_sql_user.google_sql_user.users: Destruction complete after 13s
TestTerraformCreateGCPSQL 2022-03-21T15:29:46+07:00 logger.go:66: random_id.random_string: Destroying... [id=fJw8UO7QqVRjs9cT]
TestTerraformCreateGCPSQL 2022-03-21T15:29:46+07:00 logger.go:66: random_id.random_string: Destruction complete after 0s
TestTerraformCreateGCPSQL 2022-03-21T15:29:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Destroying... [id=sql-instance-ddbb7566]
TestTerraformCreateGCPSQL 2022-03-21T15:29:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:30:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:30:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:30:26+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 40s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:30:36+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 50s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:30:46+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 1m0s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:30:56+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 1m10s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:31:06+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 1m20s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:31:16+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Still destroying... [id=sql-instance-ddbb7566, 1m30s elapsed]
TestTerraformCreateGCPSQL 2022-03-21T15:31:18+07:00 logger.go:66: module.test_sql_database_instance.google_sql_database_instance.instance: Destruction complete after 1m33s
TestTerraformCreateGCPSQL 2022-03-21T15:31:18+07:00 logger.go:66: random_id.instance_suffix: Destroying... [id=3bt1Zg]
TestTerraformCreateGCPSQL 2022-03-21T15:31:18+07:00 logger.go:66: random_id.instance_suffix: Destruction complete after 0s
TestTerraformCreateGCPSQL 2022-03-21T15:31:18+07:00 logger.go:66: 
TestTerraformCreateGCPSQL 2022-03-21T15:31:18+07:00 logger.go:66: Destroy complete! Resources: 6 destroyed.
TestTerraformCreateGCPSQL 2022-03-21T15:31:18+07:00 logger.go:66: 
--- PASS: TestTerraformCreateGCPSQL (1030.27s)
PASS
ok      github.com/honestbank/terraform-gcp-sql 1030.941s
```